In [2]:
import pandas as pd 
import sqlite3

In [3]:
path = r'C:\Users\yakin\OneDrive - Universidad de Guanajuato\Documentos\Universidad de Guanajuato\8vo Semestre'
database = path + r'\database.sqlite'

# iniciar coneccion con la base de datos
conn = sqlite3.connect(database)

In [4]:
# estructura 'global' de la base de datos
tables = pd.read_sql("""SELECT * FROM sqlite_master
                        WHERE type='table';""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,4,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,Player_Attributes,Player_Attributes,11,"CREATE TABLE ""Player_Attributes"" (\n\t`id`\tIN..."
2,table,Player,Player,14,CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3,table,Match,Match,18,CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4,table,League,League,24,CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5,table,Country,Country,26,CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6,table,Team,Team,29,"CREATE TABLE ""Team"" (\n\t`id`\tINTEGER PRIMARY..."
7,table,Team_Attributes,Team_Attributes,2,CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

# Ejercicio

1. ¿Cuántos equipos diferentes hay?
2. ¿Cuántos jugadores con nombre Michael cumplen años en 1992?

In [9]:
s = """
SELECT COUNT(DISTINCT team_long_name)
FROM Team	
"""

different_teams = pd.read_sql(s, conn)
different_teams

   COUNT(DISTINCT team_long_name)
0                             296

In [8]:
s = """
SELECT COUNT(*)
FROM Player 
WHERE player_name LIKE 'Michael%' AND birthday LIKE '1992%'
"""

players_birthday_1992 = pd.read_sql(s, conn)
players_birthday_1992

   COUNT(*)
0         6